{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "batch_input_shape": [null, 199], "dtype": "float32", "units": 64, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": -1.0, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999987376214e-07}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 5, "axis": 0}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 32, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": -1.0, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999987376214e-07}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 5, "axis": 0}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 32, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": -1.0, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999987376214e-07}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 5, "axis": 0}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 32, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": -1.0, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999987376214e-07}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 5, "axis": 0}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 32, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": -1.0, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999987376214e-07}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 5, "axis": 0}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "units": 16, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": -1.0, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999987376214e-07}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 5, "axis": 0}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "units": 16, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": -1.0, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999987376214e-07}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 5, "axis": 0}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 1.0, "dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}